runs/openfoam_smoke_test/openfoam/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 3.0000);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 3.0000);
    }

    outlet
    {
        type            zeroGradient;
    }

    sides
    {
        type            slip;
    }

    "(hub|duct|hub_wall|duct_wall|rotor.*|stator.*)"
    {
        type            noSlip;
    }
}

// ************************************************************************* //
