runs/openfoam_smoke_test/openfoam/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 5.989468e+01;

boundaryField
{
    inlet
    {
        type            turbulentMixingLengthFrequencyInlet;
        mixingLength    5.600000e-03;
        value           uniform 5.989468e+01;
    }

    outlet
    {
        type            zeroGradient;
    }

    sides
    {
        type            slip;
    }

    "(hub|duct|hub_wall|duct_wall|rotor.*|stator.*)"
    {
        type            omegaWallFunction;
        value           uniform 5.989468e+01;
    }
}

// ************************************************************************* //
