runs/openfoam_smoke_test/openfoam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          169;
        startFace       25228;
    }
    outlet
    {
        type            patch;
        nFaces          169;
        startFace       25397;
    }
    sides
    {
        type            patch;
        nFaces          1196;
        startFace       25566;
    }
    rotor_1
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          404;
        startFace       26762;
    }
    hub
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          516;
        startFace       27166;
    }
)

// ************************************************************************* //
